# StudyProject

Морской бой»: вывести на экран массив 10х10
Файловый менеджер
Console.WriteLine("Выбрать Домашка от 1 до  4 или 5- если хотите выйти из программы");
Console.WriteLine("Написать метод GetFullName(string firstName, string lastName, string patronymic), принимающий на вход ФИО в разных аргументах и возвращающий объединённую строку с ФИО. Используя метод, написать программу, выводящую в консоль 3–4 разных ФИО");
Console.WriteLine("Написать программу, принимающую на вход строку — набор чисел, разделенных пробелом, и возвращающую число — сумму всех чисел в строке.Ввести данные с клавиатуры и вывести результат на экран.");
Console.WriteLine("Написать метод по определению времени года.На вход подаётся число – порядковый номер месяца.На выходе — значение из перечисления (enum)" +
" — Winter, Spring, Summer, Autumn.Написать метод, принимающий на вход значение из этого перечисления и возвращающий название времени года(зима, весна, лето, осень). " +
"Используя эти методы, ввести с клавиатуры номер месяца и вывести название времени года.Если введено некорректное число," +
" вывести в консоль текст «Ошибка: введите число от 1 до 12».");
Console.WriteLine("Написать программу, вычисляющую число Фибоначчи для заданного значения рекурсивным способом");
